{
  "owner": "Texoma Trucking",
  "siteName": "TEXOMA TRUCKING",
  "siteDescription": "We are a specialized transport company based in the Texoma area, dedicated to the reliable transportation of steel and trailers directly from manufacturers in southern Oklahoma and northern Texas to destinations across the USA. With a fleet equipped to handle heavy loads and long hauls, we ensure your cargo is delivered safely and on time, no matter where it needs to go.",
  "about": "Established in 2024, our transport company specializes in the reliable and efficient transportation of steel and trailers directly from manufacturers in southern Oklahoma and northern Texas to destinations across the USA. As a family-owned business, we are rooted in strong values and a commitment to exceptional service. We pride ourselves on offering fair and competitive rates, ensuring that your cargo is delivered safely and on time. Our team goes above and beyond to meet your needs, making sure every delivery exceeds your expectations.",
  "contact": {
    "email": "info@texomatrucking.com",
    "phone": "646-841-6483",
    "address": "10916 lois lane, Kingston,, Oklahoma, USA 73439"
  },
  "pages": [
    {
      "title": "Home",
      "href": "/"
    },
    {
      "title": "Projects",
      "href": "/projects"
    },
    {
      "title": "Contact",
      "href": "/contact"
    }
  ],
  "social": [
  
  ],
  "projects": [
    {
      "projectTitle": "Project 1",
      "href": "project/one",
      "about": "Database of books and reviews from users complete with auth and comments and so much more!!!",
      "type": "Python, Django, HTML, CSS",
      "repo": "https://github.com",
      "image": "https://flowbite.s3.amazonaws.com/blocks/marketing-ui/cta/cta-dashboard-mockup.svg"
    },
    {
      "projectTitle": "Project 2",
      "href": "project/two",
      "about": "Video dashboard using JavaScript that allows user to build and share a layout of videos from YouTube.",
      "repo": "https://github.com",
      "type": "JavaScript, HTML, CSS",
      "image": "../assets/screen2.png",
      "featured": true
    },
    {
      "projectTitle": "Project 3",
      "href": "project/three",
      "about": "Some info about this project here, please add something here for this project ok here.",
      "type": "PHP, MySQL, HTML, CSS",
      "repo": "https://github.com",
      "image": "../assets/screen2.png"
    },
    {
      "projectTitle": "Project 4",
      "href": "project/four",
      "about": "Some info about project 4 I'm not sure haha ok see ya",
      "type": "WordPress",
      "repo": "https://github.com"
    }
  ]
}
